# 7.1 Handling Missing Data

In [1]:
import pandas as pd 
import numpy as np

string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[1] = pd.NA
string_data.isnull()

0     True
1     True
2     True
3    False
dtype: bool

## 7.1.1 Filtering Out Missing Data

In [5]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1.,6.5,3.], [1.,NA,NA], [NA,NA,NA], [NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna(axis = 1, how = 'all').dropna(axis = 0, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  0.140101       NaN       NaN
1 -0.967300       NaN       NaN
2  1.485734       NaN -1.026219
3 -1.316954       NaN -1.302342
4  0.550559 -0.724321  0.179112
5 -0.120869  0.281905 -1.179867
6  0.443008 -0.850480 -0.927337

In [22]:
df.dropna(axis = 0)

          0         1         2
4  0.550559 -0.724321  0.179112
5 -0.120869  0.281905 -1.179867
6  0.443008 -0.850480 -0.927337

In [23]:
df.dropna(axis = 0, thresh = 2)

          0         1         2
2  1.485734       NaN -1.026219
3 -1.316954       NaN -1.302342
4  0.550559 -0.724321  0.179112
5 -0.120869  0.281905 -1.179867
6  0.443008 -0.850480 -0.927337

## 7.1.2 Filling in Missing Data

In [24]:
df.fillna(0)

          0         1         2
0  0.140101  0.000000  0.000000
1 -0.967300  0.000000  0.000000
2  1.485734  0.000000 -1.026219
3 -1.316954  0.000000 -1.302342
4  0.550559 -0.724321  0.179112
5 -0.120869  0.281905 -1.179867
6  0.443008 -0.850480 -0.927337

In [25]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.140101  0.500000  0.000000
1 -0.967300  0.500000  0.000000
2  1.485734  0.500000 -1.026219
3 -1.316954  0.500000 -1.302342
4  0.550559 -0.724321  0.179112
5 -0.120869  0.281905 -1.179867
6  0.443008 -0.850480 -0.927337

In [26]:
_ = df.fillna(0,inplace = True)
df

          0         1         2
0  0.140101  0.000000  0.000000
1 -0.967300  0.000000  0.000000
2  1.485734  0.000000 -1.026219
3 -1.316954  0.000000 -1.302342
4  0.550559 -0.724321  0.179112
5 -0.120869  0.281905 -1.179867
6  0.443008 -0.850480 -0.927337

In [27]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -0.119925 -1.290398  0.437124
1  1.078698  0.395137  1.151362
2  0.489889       NaN -1.386071
3  0.676495       NaN -1.319729
4  0.209299       NaN       NaN
5  0.363114       NaN       NaN

In [28]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.119925 -1.290398  0.437124
1  1.078698  0.395137  1.151362
2  0.489889  0.395137 -1.386071
3  0.676495  0.395137 -1.319729
4  0.209299  0.395137 -1.319729
5  0.363114  0.395137 -1.319729

In [29]:
df.fillna(method = 'bfill')

          0         1         2
0 -0.119925 -1.290398  0.437124
1  1.078698  0.395137  1.151362
2  0.489889       NaN -1.386071
3  0.676495       NaN -1.319729
4  0.209299       NaN       NaN
5  0.363114       NaN       NaN

In [30]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0 -0.119925 -1.290398  0.437124
1  1.078698  0.395137  1.151362
2  0.489889  0.395137 -1.386071
3  0.676495  0.395137 -1.319729
4  0.209299       NaN -1.319729
5  0.363114       NaN -1.319729

In [31]:
data = pd.Series([1.,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [33]:
data.mean()

3.8333333333333335

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

## 7.2.1 Removing Duplicates

In [34]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [38]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [39]:
data.drop_duplicates(['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [40]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 7.2.2 Transforming Data Using a Function or Mapping

In [41]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                             'pastrami','honey ham','nova lox'],
                     'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox': 'salmon'
}

In [43]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [44]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [45]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations and other data cleaning-related operations

## 7.2.3 Replacing Values

In [46]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [50]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 7.2.4 Renaming Axis Indexes

In [52]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio','Colorado','New York'],
                    columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [53]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [54]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [55]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [56]:
data.rename(index = {'OHIO':'INDIANA'},
            columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [57]:
data.rename(index = {'OHIO':'INDIANA'}, inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 7.2.5 Discretization and Binning

In [58]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

bins = [18,25,35,60,100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [59]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [60]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [61]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [62]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [64]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [65]:
pd.cut(ages, [18,26,36,61,100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [66]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [68]:
pd.cut(ages, bins, labels = group_names).value_counts()

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [69]:
data = np.random.rand(20)
pd.cut(data, 4, precision = 2)

[(0.017, 0.26], (0.73, 0.97], (0.26, 0.49], (0.26, 0.49], (0.26, 0.49], ..., (0.49, 0.73], (0.49, 0.73], (0.73, 0.97], (0.73, 0.97], (0.73, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.017, 0.26] < (0.26, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

In [70]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.0444, 0.699], (0.0444, 0.699], (-3.198, -0.671], (-3.198, -0.671], (-0.671, 0.0444], ..., (-0.671, 0.0444], (-3.198, -0.671], (0.699, 3.177], (-0.671, 0.0444], (0.0444, 0.699]]
Length: 1000
Categories (4, interval[float64]): [(-3.198, -0.671] < (-0.671, 0.0444] < (0.0444, 0.699] < (0.699, 3.177]]

In [71]:
pd.value_counts(cats)

(0.699, 3.177]      250
(0.0444, 0.699]     250
(-0.671, 0.0444]    250
(-3.198, -0.671]    250
dtype: int64

In [72]:
cats.value_counts()

(-3.198, -0.671]    250
(-0.671, 0.0444]    250
(0.0444, 0.699]     250
(0.699, 3.177]      250
dtype: int64

In [73]:
pd.qcut(data, [0,0.1,0.5,0.9,1.])

[(0.0444, 1.307], (0.0444, 1.307], (-1.292, 0.0444], (-1.292, 0.0444], (-1.292, 0.0444], ..., (-1.292, 0.0444], (-3.198, -1.292], (1.307, 3.177], (-1.292, 0.0444], (0.0444, 1.307]]
Length: 1000
Categories (4, interval[float64]): [(-3.198, -1.292] < (-1.292, 0.0444] < (0.0444, 1.307] < (1.307, 3.177]]

In [74]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.198, -1.292]    100
(-1.292, 0.0444]    400
(0.0444, 1.307]     400
(1.307, 3.177]      100
dtype: int64

## 7.2.6 Detecting and Filtering Outliers

In [75]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017979     0.010034    -0.020804     0.047077
std       1.003889     0.985285     0.999739     0.982343
min      -3.117124    -2.796949    -3.770263    -3.303546
25%      -0.651838    -0.640625    -0.705982    -0.612505
50%       0.033314     0.071763    -0.015018     0.053733
75%       0.677913     0.644339     0.686406     0.731198
max       3.203362     2.699621     2.735744     3.532948

In [76]:
col = data[2]
col[np.abs(col) > 3]

371   -3.770263
619   -3.105237
919   -3.498792
994   -3.192759
Name: 2, dtype: float64

In [77]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
11   1.807044  0.255963 -0.227225 -3.303546
53  -0.390242 -1.394648 -0.195805  3.031261
163  0.312298  0.571747  0.486833 -3.300276
317  1.918309  1.022136  0.261352  3.532948
371 -0.733778 -0.720868 -3.770263  1.697682
452 -2.302041 -1.166684 -0.543394 -3.294057
458 -3.117124  1.757360 -0.396075  1.365955
619  0.492049  1.098522 -3.105237 -2.314828
657 -3.011942  2.640193  0.519516  1.463447
707  3.203362 -1.016553  2.155415 -0.235923
919 -1.301833 -0.614258 -3.498792  2.189754
994 -1.022186  0.802211 -3.192759  0.116267

In [79]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017905     0.010034    -0.019237     0.047411
std       1.002868     0.985285     0.994604     0.977564
min      -3.000000    -2.796949    -3.000000    -3.000000
25%      -0.651838    -0.640625    -0.705982    -0.612505
50%       0.033314     0.071763    -0.015018     0.053733
75%       0.677913     0.644339     0.686406     0.731198
max       3.000000     2.699621     2.735744     3.000000

In [80]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0  1.0  1.0  1.0
2  1.0 -1.0  1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0  1.0

## 7.2.7 Permutation and Random Sampling

In [81]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
sampler = np.random.permutation(5)
sampler

array([4, 3, 2, 0, 1])

In [83]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7

In [84]:
df.sample(n = 3)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

In [85]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n = 10, replace = True)
draws

0    5
0    5
2   -1
0    5
4    4
3    6
3    6
4    4
1    7
2   -1
dtype: int64

## 7.2.8 Computing Indicator / Dummy Variables

In [86]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'], 
                   'data1':range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [87]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [88]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [89]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [92]:
mnames = ['movie_id', 'title','genres']
movies = pd.read_table('/Users/boyuan/Desktop/OneDrive/Data Science/Python/Python for data analysis 2nd/datasets/movielens/movies.dat', 
                       sep = '::', 
                       header = None, 
                       names = mnames, 
                       engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [93]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)

genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [94]:
zero_matrix = np.zeros((len(movies), len(genres)))

dummies = pd.DataFrame(zero_matrix, columns = genres)

gen = movies.genres[0]

gen.split('|')

['Animation', "Children's", 'Comedy']

In [95]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [96]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [97]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [98]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [99]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

## 7.3.1 String Object Methods

In [106]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [115]:
type(val)

str

In [107]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [108]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [109]:
'::'.join(pieces)

'a::b::guido'

In [110]:
'guido' in val

True

In [111]:
val.index(',')

1

In [112]:
val.find(':')

-1

In [113]:
val.index(':')

ValueError: substring not found

In [116]:
val.count(",")

2

In [117]:
val.replace(',','::')

'a::b:: guido'

In [118]:
val.replace(',','')

'ab guido'

## 7.3.2 Regular Expressions

In [119]:
import re

text = "foo    bar\t baz   \tqux"

re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [120]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [121]:
regex.findall(text)

['    ', '\t ', '   \t']

In [122]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [123]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [124]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [125]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [126]:
m = regex.search(text)
m

In [127]:
text[m.start():m.end()]

'dave@google.com'

In [128]:
print(regex.match(text))

None

In [129]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [130]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [131]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [132]:
m = regex.match('wesm@bright.net')

In [133]:
m.groups()

('wesm', 'bright', 'net')

In [134]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [135]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## 7.3.3 Vectorized String Functions in pandas

In [136]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [137]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [138]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [139]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [140]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [145]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [ ]:
matches.str.get(1)

In [ ]:
matches.str[0]

In [147]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

# 7.4 Conclusion